# SaveLocalAfter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions..::..SaveLocalAfter Property
SynchronizeWithCentralOptions Class See Also
---
True means to save local after saving changes to central. True by default. Silently ignored if the model in the current session is central rather than local.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool SaveLocalAfter { get; set; }
```

Visual Basic
---
```text
Public Property SaveLocalAfter As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SaveLocalAfter {
	bool get ();
	void set (bool value);
}
```

# Remarks
It is recommended practice to save local after SWC because otherwise local becomes incompatible with central.
# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace